---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooManyMeshes
source: html/0f1d4267-f6b9-56a1-c4ee-cf1489e335cb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooManyMeshes Property

The layers you have selected contain more than one mesh. You may want to go back and import the meshes separately. If you continue, the meshes will be combined and a new boundary will be created.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyMeshes { get; }
```